a = float(input("Введите сторону a: "))
b = float(input("Введите сторону b: "))
c = float(input("Введите сторону c: ")) # Получение сторон от пользователя

if a + b > c and a + c > b and b + c > a: # Существует ли такой треугольник?
    if a == b == c:
        print("Равносторонний треугольник")
    elif a == b != c or a == c != b or b == c != a: # Проверка всех сторон
        print("Равнобедренный треугольник")
    else:
        print("Разносторонний треугольник")
else:
    print("Такого треугольника не существует") # Такого не существует